Revit 2027 API
AnalyticalOpening.IsCurveLoopValidForAnalyticalOpening Method
 Checks if curve loop is valid for Analytical Opening.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCurveLoopValidForAnalyticalOpening(
	CurveLoop loop,
	Document aDoc,
	ElementId panelId
)
Public Shared Function IsCurveLoopValidForAnalyticalOpening (
	loop As CurveLoop,
	aDoc As Document,
	panelId As ElementId
) As Boolean
public:
static bool IsCurveLoopValidForAnalyticalOpening(
	CurveLoop^ loop,
	Document^ aDoc,
	ElementId^ panelId
)
static member IsCurveLoopValidForAnalyticalOpening :
        loop : CurveLoop *
        aDoc : Document *
        panelId : ElementId -> bool
Parameters
loop CurveLoop
 The curve loop to be checked.
aDoc Document
 Revit document.
panelId ElementId
 ElementId of the AnalyticalPanel on which we create the Opening.
Return Value
Boolean
 Returns true if curve loop is ok, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace